/* automatically generated by rust-bindgen 0.72.0 */

pub type cl_half = u16;
pub type cl_float = f32;
pub type cl_double = f64;
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub union cl_float2 {
    pub s: [cl_float; 2usize],
    pub __bindgen_anon_1: cl_float2__bindgen_ty_1,
    pub __bindgen_anon_2: cl_float2__bindgen_ty_2,
    pub __bindgen_anon_3: cl_float2__bindgen_ty_3,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_float2__bindgen_ty_1 {
    pub x: cl_float,
    pub y: cl_float,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_float2__bindgen_ty_1"][::std::mem::size_of::<cl_float2__bindgen_ty_1>() - 8usize];
    ["Alignment of cl_float2__bindgen_ty_1"]
        [::std::mem::align_of::<cl_float2__bindgen_ty_1>() - 4usize];
    ["Offset of field: cl_float2__bindgen_ty_1::x"]
        [::std::mem::offset_of!(cl_float2__bindgen_ty_1, x) - 0usize];
    ["Offset of field: cl_float2__bindgen_ty_1::y"]
        [::std::mem::offset_of!(cl_float2__bindgen_ty_1, y) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_float2__bindgen_ty_2 {
    pub s0: cl_float,
    pub s1: cl_float,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_float2__bindgen_ty_2"][::std::mem::size_of::<cl_float2__bindgen_ty_2>() - 8usize];
    ["Alignment of cl_float2__bindgen_ty_2"]
        [::std::mem::align_of::<cl_float2__bindgen_ty_2>() - 4usize];
    ["Offset of field: cl_float2__bindgen_ty_2::s0"]
        [::std::mem::offset_of!(cl_float2__bindgen_ty_2, s0) - 0usize];
    ["Offset of field: cl_float2__bindgen_ty_2::s1"]
        [::std::mem::offset_of!(cl_float2__bindgen_ty_2, s1) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_float2__bindgen_ty_3 {
    pub lo: cl_float,
    pub hi: cl_float,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_float2__bindgen_ty_3"][::std::mem::size_of::<cl_float2__bindgen_ty_3>() - 8usize];
    ["Alignment of cl_float2__bindgen_ty_3"]
        [::std::mem::align_of::<cl_float2__bindgen_ty_3>() - 4usize];
    ["Offset of field: cl_float2__bindgen_ty_3::lo"]
        [::std::mem::offset_of!(cl_float2__bindgen_ty_3, lo) - 0usize];
    ["Offset of field: cl_float2__bindgen_ty_3::hi"]
        [::std::mem::offset_of!(cl_float2__bindgen_ty_3, hi) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_float2"][::std::mem::size_of::<cl_float2>() - 8usize];
    ["Alignment of cl_float2"][::std::mem::align_of::<cl_float2>() - 8usize];
    ["Offset of field: cl_float2::s"][::std::mem::offset_of!(cl_float2, s) - 0usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub union cl_double2 {
    pub s: [cl_double; 2usize],
    pub __bindgen_anon_1: cl_double2__bindgen_ty_1,
    pub __bindgen_anon_2: cl_double2__bindgen_ty_2,
    pub __bindgen_anon_3: cl_double2__bindgen_ty_3,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_double2__bindgen_ty_1 {
    pub x: cl_double,
    pub y: cl_double,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_double2__bindgen_ty_1"]
        [::std::mem::size_of::<cl_double2__bindgen_ty_1>() - 16usize];
    ["Alignment of cl_double2__bindgen_ty_1"]
        [::std::mem::align_of::<cl_double2__bindgen_ty_1>() - 8usize];
    ["Offset of field: cl_double2__bindgen_ty_1::x"]
        [::std::mem::offset_of!(cl_double2__bindgen_ty_1, x) - 0usize];
    ["Offset of field: cl_double2__bindgen_ty_1::y"]
        [::std::mem::offset_of!(cl_double2__bindgen_ty_1, y) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_double2__bindgen_ty_2 {
    pub s0: cl_double,
    pub s1: cl_double,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_double2__bindgen_ty_2"]
        [::std::mem::size_of::<cl_double2__bindgen_ty_2>() - 16usize];
    ["Alignment of cl_double2__bindgen_ty_2"]
        [::std::mem::align_of::<cl_double2__bindgen_ty_2>() - 8usize];
    ["Offset of field: cl_double2__bindgen_ty_2::s0"]
        [::std::mem::offset_of!(cl_double2__bindgen_ty_2, s0) - 0usize];
    ["Offset of field: cl_double2__bindgen_ty_2::s1"]
        [::std::mem::offset_of!(cl_double2__bindgen_ty_2, s1) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_double2__bindgen_ty_3 {
    pub lo: cl_double,
    pub hi: cl_double,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_double2__bindgen_ty_3"]
        [::std::mem::size_of::<cl_double2__bindgen_ty_3>() - 16usize];
    ["Alignment of cl_double2__bindgen_ty_3"]
        [::std::mem::align_of::<cl_double2__bindgen_ty_3>() - 8usize];
    ["Offset of field: cl_double2__bindgen_ty_3::lo"]
        [::std::mem::offset_of!(cl_double2__bindgen_ty_3, lo) - 0usize];
    ["Offset of field: cl_double2__bindgen_ty_3::hi"]
        [::std::mem::offset_of!(cl_double2__bindgen_ty_3, hi) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_double2"][::std::mem::size_of::<cl_double2>() - 16usize];
    ["Alignment of cl_double2"][::std::mem::align_of::<cl_double2>() - 16usize];
    ["Offset of field: cl_double2::s"][::std::mem::offset_of!(cl_double2, s) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cl_device_id {
    _unused: [u8; 0],
}
pub type cl_device_id = *mut _cl_device_id;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cl_command_queue {
    _unused: [u8; 0],
}
pub type cl_command_queue = *mut _cl_command_queue;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cl_mem {
    _unused: [u8; 0],
}
pub type cl_mem = *mut _cl_mem;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cl_event {
    _unused: [u8; 0],
}
pub type cl_event = *mut _cl_event;
pub const CLBlastStatusCode__CLBlastSuccess: CLBlastStatusCode_ = 0;
pub const CLBlastStatusCode__CLBlastOpenCLCompilerNotAvailable: CLBlastStatusCode_ = -3;
pub const CLBlastStatusCode__CLBlastTempBufferAllocFailure: CLBlastStatusCode_ = -4;
pub const CLBlastStatusCode__CLBlastOpenCLOutOfResources: CLBlastStatusCode_ = -5;
